// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "心爱的小宝贝",  // 同上...
        "这是我陪你过的",
        "第一个生日",
        "可惜",
        "疫情原因",
        "不能陪在你身边",
        "但是",
        "我们还有",
        "许许多多个生日",
        "要一起过",
        "不知不觉",
        "我们在一起",
        "已经163天了",
        "我们一起吃过很多美食",
        "绿茶，外婆家，小龙虾",
        "麻辣烫，大排档，榴莲披萨",
        "还有",
        "我做的‘黑暗料理’",
        "我们也一起去过很多地方",
        "宜家，琶醍，北京路",
        "看海，逛公园，做陶瓷",
        "我们还会一起",
        "看遍山河风景",
        "最后一段话",
        "送给你",
        "你迟到了很多年",
        "可我依然为你的出现而开心",
        "能给你的东西实在不多",
        "想把这辈子",
        "最单纯的喜欢",
        "和数不尽的温柔",
        "都给你",
        "宝贝",
        "生日快乐！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "这是我陪你过的": "./imgs/牵小手.jpg",
        "第一个生日": "./imgs/牵小手.jpg",
        "不知不觉": "./imgs/官宣.jpg",
        "我们一起吃过很多美食": "./imgs/吃1.jpg",
        "绿茶，外婆家，小龙虾": "./imgs/吃-粉.jpg",
        "麻辣烫，大排档，榴莲披萨": "./imgs/火锅.jpg",
        "宜家，琶醍，北京路": "./imgs/小兔子.jpg",
        "看海，逛公园，做陶瓷": "./imgs/陶瓷.jpg",
        "我们还会一起": "./imgs/.jpg",
        "看遍山河风景": "./imgs/海.jpg",
        "最单纯的喜欢": "./imgs/爱心-我.jpg",
        "和数不尽的温柔": "./imgs/爱心2.jpg",
        "生日快乐！": "./imgs/花.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "致我的宝贝",
    }
};
